##a=14
##b=5
##s=a+b
##v=a-b
##m=a*b
##d=a/b
##st=b**3   #возведение в степень
##print(s,v,m,d,st)

##r=3
##v=r**3
##s=r**2*6
##print(s,v)


##a=17
##b=5
##d2=a//b  #нахождение целой части
##d3=a%b    #нахождение остатка
##print(d2,d3)

##a=562
##b=a//100
##c=(a%100)//10
##d=a%10
##s=b*c*d
##print(s)

a=5
b=12
f=3*((a+b)**3)+275*(b**2)-127*a-41
print(f)

m=456
h=m//60
mn=m%60
print(h,mn)

n=12345
c=n//10000
d=(n//1000)%10
e=(n//100)%10
q=(n//10)%10
w=n%10
s=c+d+e+q+w
print(s)
